graf = {"Василеостровская": ["Гостинный двор"],
        "Гостинный двор": ["Василеостровская","Невский проспект","Маяковская"],
        "Маяковская": ["Гостинный двор","Площадь восстания","Площадь Александра Невского"],
        "Лиговский проспект": ["Площадь Александра Невского","Достоевская"],
        "Адмиралтейская": ["Садовая"],
        "Садовая": ["Адмиралтейская","Спасская","Сенная площадь","Звенигородская"],
        "Звенигородская": ["Садовая","Пушкинская","Обводный канал"],
        "Обводный канал": ["Звенигородская"],
        "Невский проспект": ["Гостинный двор","Сенная площадь"],
        "Сенная площадь": ["Спасская","Садовая","Технологический институт","Невский проспект"],
        "Технологический институт": ["Пушкинская", "Сенная площадь"],
        "Площадь восстания": ["Маяковская","Владимирская"],
        "Владимирская": ["Достоевская","Пушкинская","Площадь восстания"],
        "Пушкинская": ["Звенигородская","Технологический институт","Владимирская"],
        "Спасская": ["Садовая","Сенная площадь","Достоевская"],
        "Площадь Александра Невского": ["Лиговский проспект","Новочеркасская"],
        "Новочеркасская": ["Площадь Александра Невского","Ладожская"],
        "Ладожская": ["Новочеркасская","Проспект большевиков"],
        "Проспект большевиков": ["Ладожская"],
        "Достоевская": ["Спасская","Владимирская","Лиговский проспект"]}


#В ширину
def bfs(graph, start, end):
    queue = [[start]]  
    visited = {start}       
    head = 0                  

    while head < len(queue):
        path = queue[head]    
        head += 1
        node = path[-1]        

        if node == end:        
            return path

        for neighbor in graph.get(node, []):
            if neighbor not in visited:
                visited.add(neighbor)
                queue.append(path + [neighbor])  

    return None


#В глубину
def dfs(graph, start, end, visited=None, path=None):
    if visited is None:
        visited = set()
    if path is None:
        path = []

    visited.add(start)
    path.append(start)

    if start == end:           
        return path

    for neighbor in graph.get(start, []):
        if neighbor not in visited:
            result = dfs(graph, neighbor, end, visited, path)
            if result:
                return result

    path.pop()               
    return None
#Тест 1

print("_____________________________________________")
print(bfs(graf,"Василеостровская","Достоевская"))
print(dfs(graf,"Василеостровская","Достоевская"))
print("_____________________________________________")

#Тест 2

print(bfs(graf,"Новочеркасская","Садовая"))
print(dfs(graf,"Новочеркасская","Садовая"))
print("_____________________________________________")

#Тест 3

print(bfs(graf,"Лиговский проспект","Гостинный двор"))
print(dfs(graf,"Лиговский проспект","Гостинный двор"))
print("_____________________________________________")