graf = {
    "Василеостровская": {"Гостинный двор": 4},
    "Гостинный двор": {"Василеостровская": 4, "Невский проспект": 1, "Маяковская": 4},
    "Маяковская": {"Гостинный двор": 4, "Площадь восстания": 1, "Площадь Александра Невского": 4},
    "Лиговский проспект": {"Площадь Александра Невского": 2, "Достоевская": 2},
    "Адмиралтейская": {"Садовая": 5},
    "Садовая": {"Адмиралтейская": 5, "Спасская": 1, "Сенная площадь": 1, "Звенигородская": 5},
    "Звенигородская": {"Садовая": 5, "Пушкинская": 1, "Обводный канал": 5},
    "Обводный канал": {"Звенигородская": 5},
    "Невский проспект": {"Гостинный двор": 1, "Сенная площадь": 6},
    "Сенная площадь": {"Спасская": 1, "Садовая": 1, "Технологический институт": 6, "Невский проспект": 6},
    "Технологический институт": {"Пушкинская": 4, "Сенная площадь": 6},
    "Площадь восстания": {"Маяковская": 1, "Владимирская": 3},
    "Владимирская": {"Достоевская": 1, "Пушкинская": 3, "Площадь восстания": 3},
    "Пушкинская": {"Звенигородская": 1, "Технологический институт": 3, "Владимирская": 3},
    "Спасская": {"Садовая": 1, "Сенная площадь": 1, "Достоевская": 2},
    "Площадь Александра Невского": {"Лиговский проспект": 2, "Новочеркасская": 2},
    "Новочеркасская": {"Площадь Александра Невского": 2, "Ладожская": 2},
    "Ладожская": {"Новочеркасская": 2, "Проспект большевиков": 2},
    "Проспект большевиков": {"Ладожская": 2},
    "Достоевская": {"Спасская": 2, "Владимирская": 1, "Лиговский проспект": 2}
}
import heapq


def dijkstra(graph, start, end):

    if start == end:
        return [start], 0


    dist = {start: 0}

    prev = {start: None}


    pq = [(0, start)]

    while pq:
        current_dist, node = heapq.heappop(pq)


        if current_dist > dist.get(node, float("inf")):
            continue


        if node == end:
            break

        for neighbor, weight in graph.get(node, {}).items():
            new_dist = current_dist + weight

            if new_dist < dist.get(neighbor, float("inf")):
                dist[neighbor] = new_dist
                prev[neighbor] = node
                heapq.heappush(pq, (new_dist, neighbor))

    if end not in dist:
        return None, 0

    # Восстанавливаем путь
    path = []
    current = end

    while current is not None:
        path.append(current)
        current = prev.get(current)

    path.reverse()

    return path, dist[end]

print(dijkstra(graf,"Звенигородская","Достоевская"))
print(dijkstra(graf,"Василеостровская","Проспект большевиков"))

# Переход - 1
# Желтая - 2
# Красная - 3
# Зелёная - 4
# Фиолетовая - 5
# Синяя - 6
